<template>
  <div id="user-agreement">
      <div class="title">
        <!-- {{agrData.title}} -->
        “ToSee”服务协议
      </div>
      <div class="section-content">
        <!-- {{agrData.content}} -->
        “ToSee”服务协议（下称“本协议”）是您与“ToSee”软件（网站）服务提供者江苏精易达信息技术股份有限公司及其关联公司（下称“我们”）之间就您下载、安装、注册、登录、使用（以下统称“使用”）“ToSee”软件，并获得“ToSee”软件提供的相关服务所订立的协议。
        第一条 重要须知
        1.1为了更好地为您提供服务，请您在开始使用“ToSee”软件及相关服务之前，认真阅读并充分理解本协议，特别是涉及免除或者限制责任的条款、权利许可和信息使用的条款、同意开通和使用特殊单项服务的条款、法律适用和争议解决条款等。 其中，免除或者限制责任条款等重要内容将以加粗形式提示您注意，您应重点阅读。
        1.2 特别提醒：如您是未成年人，请务必在监护人的陪同下阅读本协议，注册使用“ToSee”软件，也请监护人切实履行监护责任。
        1.3 在您接受本协议之后，本协议可能因国家政策、产品以及履行本协议的环境发生变化而进行修改，修改后的协议发布在“ToSee”所有产品（包含但不限于APP、网站、PC客户端）上。您应不时关注平台公告、提示信息及协议等相关内容的变动。您知悉并确认，如您不同意更新后的内容，应立即停止访问、使用“ToSee”软件；若您继续访问或使用，视为知悉修改后的协议并且同意和接受。
        1.4  如果某一特定服务有单独的协议、规则、指引，您须遵守该单独的协议、规则和指引，您接受其他的所有服务均应遵守本协议。
        1.5 我们会在本协议的基础上，制定发布平台规则，平台规则是本协议的有效组成部分，您对本协议的接受与遵守也视为对平台规则的接受与遵守。
        1.6我们有权依“ToSee”软件及相关服务或运营的需要单方决定，安排或指定其关联方、控制公司、继承公司或我们认可的第三方公司继续运营“ToSee”软件。并且，就本协议项下涉及的某些服务，可能会由我们的关联方、控制公司、继承公司或认可的第三方公司向您提供。您知晓并同意接受相关服务内容，即视为同意受本协议约束。
        1.7如对本协议内容有任何疑问、意见或建议，您可通过我们官方公布的方式与我们联系。
        第二条 “ToSee”软件及相关服务
        2.1您使用“ToSee”软件及相关服务，可以通过预装、我们已授权的第三方下载等方式获取“ToSee”客户端应用程序或访问“ToSee”相关网站。若您并非从我们或经我们授权的第三方获取本软件的，我们无法保证非官方版本的“ToSee”软件能够正常使用，您因此遭受的损失与我们无关。
        2.2 我们可能为不同的终端设备开发不同的应用程序软件版本，您应当根据实际设备状况获取、下载、安装合适的版本。
        2.3为更好的提升您体验及服务，我们将不定期提供“ToSee”软件的更新或改变（包括但不限于软件修改、升级、功能强化、开发新服务、软件替换等），您可根据需要自行选择是否更新相应的版本。为保证“ToSee”软件及相关服务安全、提升您服务，“ToSee”软件及相关服务部分或全部更新后，我们将在可行情况下以适当方式（包括但不限于系统提示、公告、站内信等）提示您，您有权选择接受更新后的版本；如您选择不作更新，则“ToSee”软件及相关服务的部分功能将受到限制或不能正常使用。
        2.4 除非得到我们明示事先书面授权，您不得以任何形式对“ToSee”软件及相关服务进行包括但不限于改编、复制、传播、垂直搜索、镜像或交易等未经授权的访问或使用。
        2.5您理解，您使用“ToSee”软件及相关服务需自行准备与软件及相关服务有关的终端设备（如电脑、手机等），一旦您在终端设备中打开“ToSee”软件或访问“ToSee”相关网站，即视为您使用“ToSee”软件及相关服务。为充分实现“ToSee”的全部功能，您可能需要将终端设备联网，您理解由您承担所需要的费用（如流量费、上网费等）。
        2.6您理解并同意，为使您更好地使用“ToSee”软件及相关服务，保障您的账号安全，会要求您按照国家相关法律法规的规定、提供真实的身份信息实名注册并登录后方可使用。
        2.7如您发现“ToSee”软件内存在任何侵犯您权利的内容，请及时联系我们，并提供您有相关权利的证据，我们将会依据相关法律规定及时处理您的投诉
        第三条 关于“账号”
        3.1您需通过实名手机号注册（升级）“ToSee”账号，注册（升级）成功之后，“ToSee”会按系统规则自动分配给您一个号码，该号码即为“ToSee”账号。您需自行设置符合安全要求的密码。
        3.2在需要终止使用“ToSee”帐号服务时，符合以下条件的，您可以申请注销您的“ToSee”帐号：
        （1）您仅能申请注销您本人的帐号，并依照规定的流程进行注销；
        （2）您仍应对您在注销帐号前且使用“ToSee”服务期间的行为承担相应责任；
        （3）注销成功后，帐号记录、功能等将无法恢复或提供。
        3.3您理解并承诺，您所设置的账号不得违反国家法律法规及公司的相关规则，您的账号名称、昵称、头像和简介等注册信息及其他个人信息中不得出现违法和不良信息，未经他人许可不得用他人名义开设账号。您在账号注册及使用过程中需遵守相关法律法规，不得实施任何侵害国家利益、损害其他公民合法权益，有害社会道德风尚的行为。公司有权对您提交的注册信息进行审核。
        3.4您的账号仅限于您本人使用，未经我们书面同意，禁止以任何形式赠与、借用、出租、转让、售卖或以其他方式许可他人使用该账号。如果我们发现或者有合理理由认为使用者并非账号初始注册人，有权立即暂停或终止向该注册账号提供服务，并有权封禁及/或注销该账号 。
            3.5您有责任维护个人账号、密码的安全性与保密性，并对您以注册账号名义所从事的活动承担全部法律责任，包括但不限于您在“ToSee”上进行的任何数据修改、言论发表、款项支付等操作行为可能引起的一切法律责任。您应高度重视对账号与密码的保密，在任何情况下不向他人透露账号及密码。若发现他人未经许可使用您的账号或发生其他任何安全漏洞问题时，您应当立即通知我们。
        3.6如您丢失账号或遗忘密码，可遵照我们的申诉途径及时申诉请求找回账号或密码。您理解并认可，我们的密码找回机制仅需要识别申诉单上所填资料与系统记录资料具有一致性，而无法识别申诉人是否系真正账号有权使用者。我们特别提醒您应妥善保管您的账号和密码。当您使用完毕后，应安全退出。因您保管不当等自身原因或其他不可抗力因素导致遭受盗号或密码丢失，您应自行承担相应责任。
        3.7在注册、使用和管理账号时，您应保证注册账号时填写的身份信息的真实性，请您在注册、管理账号时使用真实、准确、合法、有效的相关身份证明材料及必要信息（包括您的姓名及电子邮件地址、联系电话、联系地址等）。依照国家相关法律法规的规定，为使用本软件及服务部分功能，您需要填写真实的身份信息，请您按照相关法律规定完成实名认证，并注意及时更新上述相关信息。若您提交的材料或提供的信息不准确、不真实、不规范、不合法或者公司有理由怀疑为错误、不实或不合法的资料，我们有权拒绝为您提供相关服务，此时您可能无法使用“ToSee”软件及相关服务或在使用过程中部分功能受到限制。
        3.8除自行注册“ToSee”账号外，您也可选择通过实名注册的第三方软件或平台您账号登录使用“ToSee”软件及相关服务，但第三方软件或平台对此有限制或禁止的除外。当您以前述已有账号登录使用的，应保证相应账号已进行实名注册登记，并同样适用本协议中的相关条款。
        3.9您理解并同意，为了充分使用账号资源，如您在注册后未及时进行初次登录使用或连续超过两个月未发生登录账号并使用等情形，我们有权收回您的账号。如您的账号被收回，您可能无法通过您此前持有的帐号登录并使用“ToSee”软件及相关服务，您该账号下保存的任何个性化设置和使用记录将无法恢复。在收回您的账号之前，我们将以适当的方式向您作出提示，如您在收到相关提示后一定期限内仍未登录、使用账号，我们将进行账号收回。
        第四条 您行为规范
        4.1您行为要求
        您应当对您使用本软件及相关服务的行为负责，除非法律允许或者经我们事先书面许可，您使用“ToSee”软件及相关服务不得具有下列行为：
        4.1.1使用未经我们授权或许可的任何插件、外挂、系统或第三方工具对“ToSee”软件及相关服务的正常运行进行干扰、破坏、修改或施加其他影响。
        4.1.2利用或针对“ToSee”软件及相关服务进行任何危害计算机网络安全的行为，包括但不限于：
        （1）使用未经许可的数据或进入未经许可的服务器/账户；
        （2）未经允许进入公众计算机网络或者他人计算机系统并删除、修改、增加存储信息；
        （3）未经许可，企图探查、扫描、测试本“软件”系统或网络的弱点或其它实施破坏网络安全的行为；
        （4）企图干涉、破坏“ToSee”系统或网站的正常运行，故意传播恶意程序或病毒以及其他破坏干扰正常网络信息服务的行为；
        （5）伪造TCP/IP数据包名称或部分名称。
        （6）违反法律法规、本协议、公司的相关规则及侵犯他人合法权益的其他行为。
        4.1.3 您不得有偿或无偿转让“ToSee”账号，以免产生纠纷。您应当自行承担由此产生的任何责任，同时我们保留追究上述行为人法律责任的权利。
        4.1.4. 您不得有其他损害“ToSee”利益的行为。
        4.1.5未经我们书面许可，您不得自行或授权、允许、协助他人对“ToSee”软件及相关服务中信息内容进行如下行为：
        （1）复制、读取、采用“ToSee”软件及相关服务的信息内容，用于包括但不限于宣传、增加阅读量、浏览量等商业用途；
        （2）擅自编辑、整理、编排“ToSee”软件及相关服务的信息内容后在“ToSee”软件及相关服务的源页面以外的渠道进行展示；
        （3）采用包括但不限于特殊标识、特殊代码等任何形式的识别方法，自行或协助第三人对“ToSee”软件及相关服务的信息内容产生流量、阅读量引导、转移、劫持等不利影响；
        （4）其他非法获取或使用“ToSee”软件及相关服务的信息内容的行为。
        4.1.6未经我们书面许可，您不得以任何方式（包括但不限于盗链、冗余盗取、非法抓取、模拟下载、深度链接、假冒注册等）直接或间接盗取“ToSee”软件及相关服务的视频、图文等信息内容，或以任何方式（包括但不限于隐藏或者修改域名、平台特有标识、您名等）删除或改变相关信息内容的权利管理电子信息。
        4.1.7经我们书面许可后，您对“ToSee”软件及相关服务的信息内容的分享、转发等行为，还应符合以下规范：
        （1）对抓取、统计、获得的相关搜索热词、命中率、分类、搜索量、点击率、阅读量等相关数据，未经我们事先书面同意，不得将上述数据以任何方式公示、提供、泄露给任何第三人；
        （2）不得把相关数据内容用于我们书面许可范围之外的目的，进行任何形式的销售和商业使用，或向第三方泄露、提供或允许第三方为任何方式的使用；
        （3）您向任何第三人分享、转发、复制“ToSee”软件及相关服务信息内容的行为，还应遵守我们为此制定的其他规范和标准。
        4.2信息内容展示及规范
        4.2.1您按规定完成实名认证后，可以以注册账号发布信息、互动交流、评论等。您在“ToSee”中因相关操作所形成的关注、粉丝信息将会向其他您展示。
        4.2.2我们致力于使发布信息、互动交流、评论成为文明、理性、友善、高质量的意见交流。在推动发布信息、互动交流、评论业务发展的同时，不断加强相应的信息安全管理能力，完善发布信息、互动交流、评论自律，切实履行社会责任，遵守国家法律法规，尊重公民合法权益，尊重社会公序良俗。
        4.2.3您制作、评论、发布、传播信息时应自觉遵守法律法规、国家利益、公民合法权益、社会公共秩序、道德风尚和信息真实性等要求，否则我们有权立即采取相应处理措施。您同意并承诺不制作、复制、发布、传播下列信息：
        （1）反对宪法确定的基本原则的；
        （2）危害国家安全，泄露国家秘密的；
        （3）颠覆国家政权、推翻社会主义制度、煽动分裂国家、破坏国家统一的；
        （4）损害国家荣誉和利益的；
        （5）宣扬恐怖主义、极端主义的；
        （6）宣扬民族仇恨、民族歧视，破坏民族团结的；
        （7）煽动地域歧视、地域仇恨的；
        （8）破坏国家宗教政策，宣扬邪教和封建迷信的；
        （9）编造、散布谣言、虚假信息，扰乱经济秩序和社会秩序、破坏社会稳定的；
        （10）散布、传播暴力、淫秽、色情、赌博、凶杀、恐怖或者教唆犯罪的；
        （11）危害网络安全、利用网络从事危害国家安全、荣誉和利益的；
        （12）侮辱或者诽谤他人，侵害他人合法权益的；
        （13）对他人进行暴力恐吓、威胁，实施人肉搜索的；
        （14）涉及他人隐私、个人信息或资料的；
        （15）散布污言秽语，损害社会公序良俗的；
        （16）侵犯他人隐私权、名誉权、肖像权、知识产权等合法权益内容的；
        （17）散布商业广告，或类似的商业招揽信息、过度营销信息及垃圾信息；
        （18）使用本网站常用语言文字以外的其他语言文字评论的；
        （19）与所评论的信息毫无关系的；
        （20）所发表的信息毫无意义的，或刻意使用字符组合以逃避技术审核的；
        （21）侵害未成年人合法权益或者损害未成年人身心健康的；
        （22）未获他人允许，偷拍、偷录他人，侵害他人合法权利的；
        （23）包含恐怖、暴力血腥、高危险性、危害表演者自身或他人身心健康内容的
        （24）其他违反法律法规、政策及公序良俗、干扰“ToSee”正常运营或侵犯其他您或第三方合法权益内容的信息。
        4.2.4您制作、发布、传播的内容需遵守《网络音视频信息服务管理规定》及相关法律法规规定，您不得利用基于深度学习、虚拟现实等的新技术新应用制作、发布、传播虚假新闻信息。您在发布或传播利用基于深度学习、虚拟现实等的新技术新应用制作的非真实音视频信息时，应当以显著方式予以标识。
        4.3如果我们有理由认为您的行为违反或可能违反上述约定的，我们可独立进行判断并处理，且在任何时候有权在不事先通知的情况下采取包括但不限于以下处罚措施：暂时限制账号的使用、永久冻结账号某项功能、永久封停账号、回收账号、剔除违法所得、扣罚保证金或佣金、终止所有服务等，并追究相关责任。
        第五条 账号安全及隐私保护
        5.1 您的“ToSee”账号、密码属于保密信息，我们将采取积极的措施保护您账号、密码的安全。您的注册信息作为我们的商业秘密进来保护。但您同时明白，互联网的开放性以及技术更新非常快，非我们可控制的因素导致您个人信息泄漏的，我们不承担责任。
        5.2 您应当妥善保管自己的“ToSee”账号、密码，您就其账号及密码项下之一切活动负全部责任，包括您数据的修改，虚拟道具的损失以及其他所有的损失由您自行承担。您须重视“ToSee”账号密码保护。您如发现他人未经许可使用其账号时立即通知我们。
        5.3 您“ToSee”账号在丢失或遗忘密码后，可遵照我们的申诉途径及时申诉请求找回账号。您应不断提供能增加账号安全性的个人密码保护资料。您可以凭账号身份认证信息、初始注册资料及个人密码保护资料填写申诉单向我们申请找回账号。“ToSee”的密码找回机制仅负责识别申诉单上所填资料与系统记录资料的正确性，而无法识别申诉人是否系真正账号使用人。对您因被他人冒名申诉而致的任何损失，我们不承担任何责任，您知晓“ToSee”账号及密码保管责任在于您，我们并不承诺“ToSee”账号丢失或遗忘密码后您一定能通过申诉找回账号。
        5.4 如果“ToSee”账号的使用者存在使用归属争议，我们将按照评判规则，根据您提交的信息进行判定。“ToSee”账号存在争议的情况下，我们有权暂时中止争议账号的使用，由此带来的包括并不限于您通讯中断、相关服务中止等损失由您自行承担。
        5.5 请您注意勿在使用“ToSee”软件服务中透露自己的各类财产账户、银行卡、信用卡、第三方支付账户及对应密码等重要资料，否则由此带来的任何损失由您自行承担。
        5.6 您在使用“ToSee”软件服务时不可将自认为隐私的信息发表、上传至“ToSee”软件，也不可将该等信息通过“ToSee”软件的服务传播给其他人。若您的行为引起的隐私泄漏，由您承担责任。
        5.7 我们在提供服务时可能会搜集您信息，我们会明确告知您，通常信息仅限于您姓名、性别、年龄、出生日期、身份证号、家庭住址、教育程度、公司情况、所属行业、兴趣爱好等，您同意我们的上述行为。
        5.8 就下列相关事宜的发生，我们不承担任何法律责任：
        5.8.1 我们根据法律规定或相关政府机关、安全机关、司法机关的要求提供您的个人信息；
        5.8.2由于您将您密码告知他人或与他人共享注册账户，由此导致的任何个人信息的泄漏，或其他非因我们原因导致的个人信息的泄漏；
        5.8.3任何由于黑客攻击、电脑病毒侵入造成的信息泄漏；
        5.8.4因不可抗力导致的信息泄漏。
        5.9 我们重视对您隐私的保护，关于您的资料和其他特定资料依《隐私政策》受到保护与规范，详情请参阅《隐私政策》。
        第六条 知识产权
        6.1我们在“ToSee”软件及相关服务中提供的内容（包括但不限于软件、技术、程序、网页、文字、图片、图像、音频、视频、图表、版面设计、电子文档等）的知识产权属于我们所有。我们提供本服务时所依托的软件的著作权、专利权及其他知识产权均归我们所有。
        6.2您理解并同意，您在使用“ToSee”软件及相关服务时发布上传的文字、图片、视频、音频等各种形式的内容及其中包含的音乐、声音、台词、视觉设计等所有组成部分均由您原创或已获合法授权（且含转授权）。您通过“ToSee”软件上传、发布内容的知识产权归属您或原始著作权人所有。
        6.3除非有相反证明，您知悉、理解并同意，您在使用“ToSee”软件服务时发布上传的文字、图片、音视频、软件以及表演等原创的信息，此部分信息的知识产权归您所有，但您的发表、上传行为是对我们的授权，您确认将您发表、上传的信息非独占性、永久性地授权给我们，该授权可转授权。我们可将前述信息在我们旗下的服务平台上使用，可再次编辑后使用，也可以由我们授权给合作方使用。
        6.4您确认并同意授权我们以自己的名义或委托专业第三方对侵犯您上传发布的享有知识产权的内容进行代维权，维权形式包括但不限于：监测侵权行为、发送维权函、提起诉讼或仲裁、调解、和解等，我们有权对维权事宜做出决策并独立实施。
        6.5我们为“ToSee”软件开发、运营提供技术支持，并对“ToSee”软件及相关服务的开发和运营等过程中产生的所有数据和信息等享有法律法规允许范围内的全部权利。
        第七条 未成年人使用条款
        7.1若您是未满18周岁的未成年人，您应在您的监护人监护、指导并获得监护人同意的情况下，认真阅读并同意本协议后，方可使用软件及相关服务。
        7.2公司重视对未成年人个人信息的保护，未成年您在填写个人信息时，请加强个人保护意识并谨慎对待，并应在取得监护人的同意以及监护人指导下正确使用“ToSee”软件及相关服务。
        7.3未成年人您及其监护人理解并确认，如您违反法律法规、本协议内容，则您及您的监护人应依照法律规定承担因此而可能引起的全部法律责任。
        7.4未成年人您必须遵守《全国青少年网络文明公约》。
        第八条 通知
        8.1 您同意我们以以下合理的方式向您送达各类通知：
        （1）公示的文案；
        （2）系统消息、弹出消息、客户端推送的消息；
        （3）根据您预留于“ToSee”软件的联系方式发出的电子邮件、手机短信、函件等。
        8.2 对于在“ToSee”软件上因交易活动引起的任何纠纷，您同意司法机关可以通过手机短信、电子邮件等现代通讯方式或邮寄方式向您送达法律文书。您指定接收法律文书的手机号码、电子邮箱等联系方式为您在“ToSee”软件注册、更新时提供的手机号码、电子邮箱联系方式，司法机关向上述联系方式发出法律文书即视为送达。您指定的邮寄地址为您的法定联系地址或您提供的有效联系地址。
        8.3 您应当保证所提供的联系方式是准确、有效的，并进行实时更新。如果因提供的联系方式不确切，或不及时告知变更后的联系方式，使法律文书无法送达或未及时送达，由您自行承担由此可能产生的法律后果。
            第九条 服务的变更、中断和终止
        9.1您理解并同意，我们提供的“ToSee”软件及相关服务是按照现有技术和条件所能达到的现状提供的。我们会尽最大努力向您提供服务，确保服务的连贯性和安全性。您理解，我们不能随时或始终预见和防范技术及其他风险，包括但不限于因不可抗力、网络原因、第三方服务瑕疵、第三方网站等原因可能导致的服务中断、不能正常使用“ToSee”软件及相关服务以及其他的损失和风险。
        9.2您理解并同意，我们为了服务整体运营、平台运营安全的需要，有权视具体情况决定服务/功能的设置及其范围，或决定修改、中断、中止或终止“ToSee”软件及相关服务。
        第十条 违约处理
        10.1针对您违反本协议或其他服务条款的行为，我们有权独立判断并视情况采取预先警示、拒绝发布、立即停止传输信息、删除内容或评论、短期禁止发布内容或评论、限制账号部分或者全部功能、终止提供服务直至永久关闭账号等措施，对于因此而造成您无法正常使用账号及相关服务、无法正常获取账号内资产或其他权益等后果，我们不承担任何责任。我们有权公告处理结果，且有权根据实际情况决定是否恢复相关账号的使用。对涉嫌违反法律法规、涉嫌违法犯罪的行为，我们将保存有关记录，并依法向有关主管部门报告、配合有关主管部门调查、向公安机关报案等。对已删除内容公司有权不予恢复。
        10.2因您违反本协议或其他服务条款规定，引起第三方投诉或诉讼索赔的，您应当自行处理并承担可能因此引起的全部法律责任。因您的违法或违约等行为导致我们及/或我们的关联方、控制公司、继承公司向任何第三方赔偿或遭受国家机关处罚的，您还应足额赔偿我们及/或我们的关联方、控制公司、继承公司因此遭受的全部损失。
        10.3我们尊重并保护您及他人的知识产权、名誉权、姓名权、隐私权等合法权益。您保证，在使用“ToSee”软件及相关服务时上传的文字、图片、视频、音频、链接等不侵犯任何第三方的知识产权、名誉权、姓名权、隐私权等权利及合法权益。否则，我们有权在收到权利方或者相关方通知的情况下移除该涉嫌侵权内容。针对第三方提出的全部权利主张，您应当自行处理并承担可能因此引起的全部法律责任；如因您的侵权行为导致我们及/或我们的关联方、控制公司、继承公司遭受损失的（包括经济、商誉等损失），您还应足额赔偿我们及/或我们的关联方、控制公司、继承公司遭受的全部损失。
        第十一条 免责声明
        11.1您理解并同意，“ToSee”软件及相关服务可能会受多种因素的影响或干扰，我们不保证(包括但不限于)：
        11.1.1“ToSee”软件及相关服务完全适合您的使用要求；
        11.1.2“ToSee”软件及相关服务不受干扰，及时、安全、可靠或不出现错误；您经由公司取得的任何软件、服务或其他材料符合您的期望；
        11.1.3“ToSee”软件及相关服务中任何错误都将能得到更正。
        11.2如有涉嫌借款、投融资、理财或其他涉财产的网络信息、账户密码、广告或推广等信息，请您谨慎对待并自行进行判断，对您因此遭受的利润、商业信誉、资料损失或其他有形或无形损失，我们不承担任何直接、间接、附带、特别、衍生性或惩罚性的赔偿责任。
        11.3您理解并同意，在使用“ToSee”软件及相关服务过程中，可能遇到不可抗力等因素（不可抗力是指不能预见、不能克服并不能避免的客观事件），包括但不限于政府行为、自然灾害（如洪水、地震、台风等）、网络原因、战争、罢工、骚乱等。出现不可抗力情况时，我们将努力在第一时间及时修复，但因不可抗力造成的暂时、中止、终止服务或造成的任何损失，我们在法律法规允许范围内免于承担责任。
        11.4我们依据本协议约定获得处理违法违规内容的权利，该权利不构成公司的义务或承诺，我们不能保证及时发现违法行为或进行相应处理。
        11.5您理解并同意，关于“ToSee”软件及相关服务，我们不提供任何种类的明示或暗示担保或条件，包括但不限于商业适售性、特定用途适用性等。您对“ToSee”软件及相关服务的使用行为应自行承担相应风险。
        11.6在任何情况下，我们均不对任何间接性、后果性、惩罚性、偶然性、特殊性或刑罚性的损害，包括因您使用“ToSee”软件及相关服务而遭受的利润损失，承担责任。除法律法规另有明确规定外，我们对您承担的全部责任，无论因何原因或何种行为方式，始终不超过您因使用“ToSee”软件及相关服务而支付给公司的费用(如有)。
        第十二条 其他
        12.1本协议的成立、生效、履行、解释及争议的解决均应适用中华人民共和国法律。若本协议之任何规定因与中华人民共和国法律抵触而无效或不可执行，则在不违反法律的前提下，这些条款将按照尽可能接近本协议原条文意旨的原则重新解释和适用，且本协议其它规定仍应具有完整的效力及效果。
        12.2本协议的签署地点为中华人民共和国南京市建邺区，若您因本协议与公司发生任何争议，双方应尽量友好协商解决，如协商不成，您同意应将相关争议提交至本协议签署地的人民法院诉讼解决。
        12.3为给您提供更好的服务或因国家法律法规、政策调整、技术条件、产品功能等变化需要，我们会适时对本协议进行修订，这些修订构成本协议的组成部分。如您对修改后的协议条款存有异议的，请立即停止登录或使用“ToSee”软件及相关服务。若您继续登录或使用“ToSee”软件及相关服务，即视为您认可并接受修改后的协议条款。

      </div>
  </div>
</template>

<script>
  export default {
    name: 'user-agreement',
    components: {

    },
    data() {
      return {
        // text: '用户服务协议',
        localUserData: '',
        agrData: {
          // content: "的“ToSee”服务协议↵“ToSee”服务协议（下称“本协议”）是您与“ToSee”软件（网站）",
          // createTime: "2020-06-15 13:26:16",
          // effectTime: "2020-07-01 15:07:40",
          // id: 1,
          // title: "用户协议",
          // type: 1,
          // updateTime: "2020-06-30 10:37:24",
        },
      }
    },
    mounted() {
      if (localStorage.loginUserInfo && JSON.parse(localStorage.loginUserInfo).token){
        this.localUserData = JSON.parse(localStorage.loginUserInfo);
      }
      this.getUserAgreement();
    },
    methods: {
      getUserAgreement(){
        this.$api.userInfo.toseeUserAgreement({toSeeType: 1, token: this.localUserData.token}).then(res => {
          // console.log(res, 'xieyi');
          this.agrData = res.data.result;
        })
      },
    }
  }
</script>
<style lang="scss" scoped>
  #user-agreement{
    width: 78%;
    min-height: 400px;
    background: #eaeaf0;
    margin: 20px auto;
    font-size: 0.12rem;
    font-family: 'Segoe UI', Tahoma, Geneva, Verdana, sans-serif;
    border-radius: 10px;
    .title{
      font-size: 0.22rem;
      color: #333333;
      line-height: 0.6rem;
      text-align: center;

    } 
    .section-content{
      color: #666666;
      line-height: 0.24rem;
    }
  }
</style>
